Repository: mackyle/fakeroot
Catalog: doc/po4a/po/*.po
Languages: de

source: 5 October 2014
de: 5. Oktober 2014

source: Debian Project
de: Debian-Projekt

source: Debian manual
de: Debian-Handbuch

source: fakeroot - run a command in an environment faking root privileges for file manipulation
de: fakeroot - einen Befehl zur Dateimanipulation in einer Umgebung mit fingierten Root-Rechten ausführen

source: SYNOPSIS
de: ÜBERSICHT

source: B<fakeroot> B<[-l|--lib> I<library]> B<[--faked> I<faked-binary>B<]> B<[-i> I<load-file>B<]> B<[-s> I<save-file>B<]> B<[-u|--unknown-is-real ]> B<[-b|--fd-base ]> B<[-h|--help ]> B<[-v|--version ]> B<[--]> B<[command]>
de: B<fakeroot> B<[-l|--lib> I<Bibliothek]> B<[--faked> I<fingiertes_Programm>B<]> B<[-i> I<zu_ladende_Datei>B<]> B<[-s> I<zu_speichernde_Datei>B<]> B<[-u|--unknown-is-real ]> B<[-b|--fd-base ]> B<[-h|--help ]> B<[-v|--version ]> B<[--]> B<[Befehl]>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<fakeroot> runs a command in an environment wherein it appears to have root privileges for file manipulation. This is useful for allowing users to create archives (tar, ar, .deb etc.) with files in them with root permissions/ownership. Without B<fakeroot> one would need to have root privileges to create the constituent files of the archives with the correct permissions and ownership, and then pack them up, or one would have to construct the archives directly, without using the archiver.
de: B<fakeroot> führt einen Befehl in einer Umgebung aus, in der es scheint, als habe er Root-Rechte zur Dateimanipulation. Auf diese Weise können einfache Benutzer Archive (tar, ar, .deb etc.) erstellen, welche Dateien enthalten, die Root-Rechte haben/Root gehören. Ohne B<fakeroot> wären Root-Rechte nötig, um die einzelnen Dateien des Archivs mit den korrekten Zugriffs- und Besitzrechten zu erstellen und sie einzuhüllen oder diese Archive müssten direkt, ohne Benutzung des Archivierungsprogramms, erstellt werden.

source: B<fakeroot> works by replacing the file manipulation library functions (chmod(2), stat(2) etc.) by ones that simulate the effect the real library functions would have had, had the user really been root. These wrapper functions are in a shared library B</usr/lib/*/libfakeroot-*.so> or similar location on your platform. The shared object is loaded through the B<LD_PRELOAD> mechanism of the dynamic loader. (See B<ld.so>(8))
de: Die Funktionsweise von B<fakeroot> besteht darin, die Bibiliotheken zur Dateimanipulation (chmod(2), stat(2) etc.) durch solche zu ersetzen, die sich so verhalten als ob der Benutzer Root wäre. Diese Wrapper-Funktionen liegen in einer Laufzeit-Bibliothek B</usr/lib/libfakeroot.so*> bzw. an dem entsprechenden Speicherort auf Ihrer Plattform. Das gemeinsame Objekt wird durch den B<LD_PRELOAD>-Mechanismus des dynamischen Ladeprogramms geladen. (Siehe B<ld.so>(8))

source: If you intend to build packages with B<fakeroot>, please try building the fakeroot package first: the "debian/rules build" stage has a few tests (testing mostly for bugs in old fakeroot versions). If those tests fail (for example because you have certain libc5 programs on your system), other packages you build with fakeroot will quite likely fail too, but possibly in much more subtle ways.
de: Falls Sie beabsichtigen, Pakete mit B<fakeroot> zu bauen, versuchen Sie bitte zuerst, das fakeroot-Paket zu bauen: Der Abschnitt »debian/rules build« enthält ein paar Tests (meist wird getestet, ob Fehler in alten fakeroot-Versionen vorliegen). Falls diese Tests fehlschlagen (zum Beispiel, weil Sie bestimmte libc5-Programme auf Ihrem System haben), wird der Bau anderer Pakete mit fakeroot ziemlich wahrscheinlich ebenfalls scheitern, aber möglicherweise auf subtilere Art.

source: Also, note that it's best not to do the building of the binaries themselves under fakeroot. Especially configure and friends don't like it when the system suddenly behaves differently from what they expect. (or, they randomly unset some environment variables, some of which fakeroot needs).
de: Beachten Sie außerdem, dass es am Besten ist, nicht den Bau der Pakete selbst unter fakeroot vorzunehmen. Insbsondere mögen es »configure« und Co. nicht, wenn sich das System plötzlich anders als von ihnen erwartet verhält (oder sie löschen den Inhalt einiger Umgebungsvariablen, die fakeroot benötigt).

source: OPTIONS
de: OPTIONEN

source: B<-l> I<library>, B<--lib> I<library>
de: B<-l> I<Bibliothek>, B<--lib> I<Bibliothek>

source: Specify an alternative wrapper library.
de: gibt eine alternative Wrapper-Biliothek an.

source: B<--faked>I<\ binary>
de: B<--faked>I<\ Programm>

source: Specify an alternative binary to use as faked.
de: gibt ein alternatives Programm an, das als fingiert benutzt werden soll.

source: B<[--]>I<\ command>
de: B<[--]>I<\ Befehl>

source: Any command you want to be ran as fakeroot. Use \(oq--\(cq if in the command you have other options that may confuse fakeroot's option parsing.
de: jeder Befehl, den Sie als fakeroot ausführen möchten. Benutzen Sie »--«, falls Sie im Befehl andere Optionen haben, die fakeroots Auswertung der Optionen durcheinanderbringen könnte.

source: B<-s>I<\ save-file>
de: B<-s>I<\ zu_speichernde_Datei>

source: Save the fakeroot environment to save-file on exit. This file can be used to restore the environment later using -i. However, this file will leak and fakeroot will behave in odd ways unless you leave the files touched inside the fakeroot alone when outside the environment. Still, this can be useful. For example, it can be used with rsync(1) to back up and restore whole directory trees complete with user, group and device information without needing to be root. See I</usr/share/doc/fakeroot/README.saving> for more details.
de: speichert die fakeroot-Umgebung beim Beenden in zu_speichernde_Datei. Diese Datei kann benutzt werden, um die Umgebung später mit -i wiederherzustellen. Diese Datei wird jedoch »porös« sein (leaken) und fakeroot wird sich seltsam verhalten, wenn Sie die Dateien nicht in Ruhe lassen, solange Sie sich außerhalb der Umgebung befinden. Das Speichern kann aber auch für andere Dinge nützlich sein. Beispielsweise können Sie so mit rsync(1) ganze Verzeichnisbäume mit Benutzer-, Gruppen und Geräteinformationen sichern und wiederherstellen, ohne dass Sie Root sein müssen. Weitere Einzelheiten finden Sie in I</usr/share/doc/fakeroot/README.saving>.

source: B<-i>I<\ load-file>
de: B<-i>I<\ zu_ladende_Datei>

source: Load a fakeroot environment previously saved using -s from load-file. Note that this does not implicitly save the file, use -s as well for that behaviour. Using the same file for both -i and -s in a single B<fakeroot> invocation is safe.
de: lädt eine vorher mit -s gespeicherte fakeroot-Umgebung aus zu_ladende_Datei. Beachten Sie, dass dies nicht implizit die Datei speichert, benutzen Sie für dieses Verhalten zusätzlich -s. Die Benutzung der gleichen Datei sowohl für -i als auch für -s in einem einzigen B<fakeroot>-Aufruf ist ungefährlich.

source: Use the real ownership of files previously unknown to fakeroot instead of pretending they are owned by root:root.
de: benutzt die echten Besitzrechte von Dateien, die fakeroot vorher unbekannt waren, anstatt so zu tun, als gehörten sie root:root.

source: B<-b>I<\ fd>
de: B<-b>I<\ Datei_Deskriptor>

source: Specify fd base (TCP mode only). fd is the minimum file descriptor number to use for TCP connections; this may be important to avoid conflicts with the file descriptors used by the programs being run under fakeroot.
de: gibt die Datei-Deskriptor-Basis an (nur im TCP-Modus). Datei_Deskriptor ist die minimale Datei-Deskriptor-Nummer, die für TCP-Verbindungen benutzt wird; dies könnte wichtig sein, um Konflikte mit den Datei-Deskriptoren von Programmen zu vermeiden, die unter fakeroot laufen.

source: Display help.
de: zeigt die Hilfe an.

source: Display version.
de: zeigt die Version an.

source: EXAMPLES
de: BEISPIELE

source: Here is an example session with B<fakeroot>. Notice that inside the fake root environment file manipulation that requires root privileges succeeds, but is not really happening.
de: Hier folgt eine Beispielsitzung mit B<fakeroot>. Beachten Sie, dass innerhalb der fingierten Root-Umgebung eine Dateimanipulation, die Root-Rechte erfordert, erfolgreich ist, obwohl sie nicht wirklich stattfindet.

source: Only the effects that user B<joost> could do anyway happen for real.
de: In Wirklichkeit geschieht nur das, was Benutzer B<joost> sowieso tun könnte.

source: B<fakeroot> was specifically written to enable users to create Debian GNU/Linux packages (in the B<deb(5)> format) without giving them root privileges. This can be done by commands like B<dpkg-buildpackage -rfakeroot> or B<debuild -rfakeroot> (actually, -rfakeroot is default in debuild nowadays, so you don't need that argument).
de: B<fakeroot> wurde vor allem geschrieben, um es Benutzern zu ermöglichen, Debian-GNU/Linux-Pakete (im B<deb(5)>-Format) zu erstellen, ohne ihnen Root-Rechte zu geben. Dies kann durch Befehle wie B<dpkg-buildpackage -rfakeroot> oder B<debuild -rfakeroot> erledigt werden (tatsächlich ist -rfakeroot heutzutage in debuild Vorgabe, so dass Sie dieses Argument nicht benötigen).

source: SECURITY ASPECTS
de: SICHERHEITSASPEKTE

source: B<fakeroot> is a regular, non-setuid program. It does not enhance a user's privileges, or decrease the system's security.
de: B<fakeroot> ist ein normales nicht-setuid-Programm. Es erweitert weder die Benutzerrechte, noch vermindert es die Sicherheit des Systems.

source: FILES
de: DATEIEN

source: I</usr/lib/*/libfakeroot-*.so> The shared library containing the wrapper functions.
de: I</usr/lib/libfakeroot/libfakeroot.so*> – die Laufzeit-Bibliothek, welche die Wrapper-Funktionen enthält.

source: ENVIRONMENT
de: UMGEBUNG

source: The key used to communicate with the fakeroot daemon. Any program started with the right B<LD_PRELOAD> and a B<FAKEROOTKEY> of a running daemon will automatically connect to that daemon, and have the same "fake" view of the file system's permissions/ownerships. (assuming the daemon and connecting program were started by the same user).
de: der Schlüssel, der benutzt wird, um mit dem fakeroot-Daemon zu kommunizieren. Jedes Programm, das mit dem richtigen B<LD_PRELOAD> und einem B<FAKEROOTKEY> eines laufenden Daemons gestartet wird, verbindet sich automatisch zu diesem Daemon und hat die gleiche fingierte Sicht auf die Zugriffs- und Besitzrechte des Dateisystems (unter der Annahme, dass Daemon und verbindendes Programm vom gleichen Benutzer gestartet wurden).

source: Fakeroot is implemented by wrapping system calls. This is accomplished by setting LD_LIBRARY_PATH=/usr/lib/fakeroot and LD_PRELOAD=libfakeroot.so.0. That library is loaded before the system's C library, and so most of the library functions are intercepted by it. If you need to set either B<LD_LIBRARY_PATH> or B<LD_PRELOAD> from within a fakeroot environment, it should be set relative to the given paths, as in B<LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/foo/bar/>
de: fakeroot wurde durch Einhüllen von Systemaufrufen implementiert. Dies wird durch die Einstellungen LD_LIBRARY_PATH=/usr/lib/fakeroot und LD_PRELOAD=libfakeroot.so.0 bewerkstelligt. Diese Bibliothek wird vor der C-Bibliothek des Systems geladen. Daher werden die meisten Bibliotheksfunktionen von ihr abgefangen. Falls Sie entweder B<LD_LIBRARY_PATH> oder B<LD_PRELOAD> aus einer fakeroot-Umgebung heraus setzen müssen, sollte es relativ zum angegebenen Pfad geschehen wie in B<LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/foo/bar/>

source: LIMITATIONS
de: EINSCHRÄNKUNGEN

source: B<Library versions>
de: B<Bibliotheksversionen>

source: Every command executed within B<fakeroot> needs to be linked to the same version of the C library as B<fakeroot> itself.
de: Jeder innerhalb B<fakeroot> ausgeführte Befehl muss zu der gleichen Version der C-Bibliothek gelinkt werden wie B<fakeroot> selbst.

source: fakeroot doesn't wrap open(), create(), etc. So, if user B<joost> does either
de: fakeroot umhült nicht open(), create(), etc. Falls Benutzer B<joost> also entweder

source: or the other way around,
de: oder andersherum

source: fakeroot has no way of knowing that in the first case, the owner of foo really should be B<joost> while the second case it should have been B<root>. For the Debian packaging, defaulting to giving all "unknown" files uid=gid=0, is always OK. The real way around this is to wrap B<open()> and B<create()>, but that creates other problems, as demonstrated by the libtricks package. This package wrapped many more functions, and tried to do a lot more than B<fakeroot .> It turned out that a minor upgrade of libc (from one where the B<stat()> function didn't use B<open()> to one with a B<stat()> function that did (in some cases) use B<open()>), would cause unexplainable segfaults (that is, the libc6 B<stat()> called the wrapped B<open()>, which would then call the libc6 B<stat()>, etc). Fixing them wasn't all that easy, but once fixed, it was just a matter of time before another function started to use open(), never mind trying to port it to a different operating system. Thus I decided to keep the number of functions wrapped by fakeroot as small as possible, to limit the likelihood of \(oqcollisions\(cq.
de: ausführt, hat fakeroot im ersten Fall keine Möglichkeit zu wissen, dass der Benutzer von foo wirklich B<joost> sein soll, während es im zweiten Fall B<root> gewesen sein soll. Für die Debian-Paketierung ist es immer in Ordnung, allen »unbekannten« Dateien uid=gid=0 zu geben. Der wahre Weg, das zu umgehen ist, B<open()> und B<create()> einzuhüllen, aber es erzeugt neue Probleme, wie vom Paket libtricks gezeigt wird. Dieses Paket hüllte viel mehr Funktionen ein und versuchte viel mehr als B<fakeroot> zu tun. Es stellte sich heraus, dass ein unbedeutendes Upgrade von libc (von einer, in der die Funktion B<stat()> B<open()> nicht nutzte, zu einer mit einer B<stat()>-Funktion, die (in einigen Fällen) B<open()> benutzte), unerklärbare Speicherzugriffsfehler verursachen würde (das heißt, das libc6-B<stat()> ruft das eingehüllte B<open()> auf, das dann libc6-B<stat()> aufrufen würde, etc). Das Beheben war alles andere als einfach, aber einmal behoben, war es nur eine Frage der Zeit, bevor eine andere Funktion begann, open() zu benutzen, ganz zu schweigen vom Versuch, es auf andere Betriebssysteme zu portieren. Daher wurde entschieden, die Anzahl der von fakeroot eingehüllten Funktionen so klein wie möglich zu halten, um die Wahrscheinlichkeit von »Zusammenstößen« so gering wie möglich zu halten.

source: B<GNU configure (and other such programs)>
de: B<GNU configure (und andere derartige Programme)>

source: fakeroot, in effect, is changing the way the system behaves. Programs that probe the system like GNU configure may get confused by this (or if they don't, they may stress fakeroot so much that fakeroot itself becomes confused). So, it's advisable not to run "configure" from within fakeroot. As configure should be called in the "debian/rules build" target, running "dpkg-buildpackage -rfakeroot" correctly takes care of this.
de: fakeroot ändert in der Tat die Art, wie sich das System verhält. Programme, die das System gründlich prüfen, wie GNU configure, könnten dadurch verwirrt werden (oder, wenn nicht, könnten sie fakeroot so beanspruchen, dass fakeroot selbst verwirrt wird). Daher ist es ratsam, »configure« nicht innerhalb von fakeroot auszuführen. Da configure im »debian/rules build«-Ziel aufgerufen werden sollte, erledigt dies »dpkg-buildpackage -rfakeroot« korrekt.

source: BUGS
de: FEHLER

source: It doesn't wrap open(). This isn't bad by itself, but if a program does open("file", O_WRONLY, 000), writes to file "file", closes it, and then again tries to open to read the file, then that open fails, as the mode of the file will be 000. The bug is that if root does the same, open() will succeed, as the file permissions aren't checked at all for root. I choose not to wrap open(), as open() is used by many other functions in libc (also those that are already wrapped), thus creating loops (or possible future loops, when the implementation of various libc functions slightly change).
de: Es hüllt open() nicht ein. Das ist an sich nicht schlecht, aber falls ein Programm open("Datei", O_WRONLY, 000) aufruft, in die Datei »Datei« schreibt, sie schließt und dann erneut versucht, die Datei zum Lesen zu öffnen, schlägt das Öffnen fehl, da der Modus der Datei 000 sein wird. Der Fehler liegt darin, dass, falls Root das Gleiche tut, open() erfolgreich sein wird, da die Dateirechte für Root überhaupt nicht geprüft werden. Es wurde entschieden, open() nicht einzuhüllen, da open() von vielen anderen Funktionen in libc benutzt wird (auch von jenen, die bereits eingehüllt sind), wodurch Schleifen erzeugt werden (oder möglicherweise zukünftige Schleifen, wenn die Implementierung verschiedener libc-Funktionen sich ein wenig ändert).

source: COPYING
de: KOPIEREN

source: B<fakeroot> is distributed under the GNU General Public License. (GPL 2.0 or greater).
de: B<fakeroot> wird unter den Bedingungen der GNU General Public License (GPL 2.0 oder höher) weitergegeben.

source: AUTHORS
de: AUTOREN

source: MANUAL PAGE
de: HANDBUCHSEITE

source: mostly by J.H.M. Dassen E<lt>jdassen@debian.orgE<gt> Rather a lot mods/additions by joost and Clint.
de: größtenteils von J.H.M. Dassen E<lt>jdassen@debian.orgE<gt>. Ziemlich viele Veränderungen/Zusätze von Joost und Clint.

source: SEE ALSO
de: SIEHE AUCH

source: B<faked>(1) B<dpkg-buildpackage>(1), B<debuild>(1) B</usr/share/doc/fakeroot/DEBUG>
de: , B<faked>(1), B<debuild>(1), B<dpkg-buildpackage>(1), B</usr/share/doc/fakeroot/DEBUG>

source: 17 June 2004
de: 17. Juni 2004

source: Debian GNU/Linux manual
de: Debian-GNU/Linux-Handbuch

source: faked - daemon that remembers fake ownership/permissions of files manipulated by fakeroot processes.
de: faked - Daemon, der sich an fingierte Besitz-/Zugriffsrechte von Dateien erinnert, die durch fakeroot-Prozesse manipuliert wurden

source: B<faked> B<[--debug] [--foreground] [--cleanup] [--key> I<msg-key>B<]> B<[--load] [--save-file> I<save-file>B<]> B<[--port> I<TCP-port>B<]>
de: B<faked> B<[--debug] [--foreground] [--cleanup] [--key> I<Nachrichtenschlüssel>B<]> B<[--load] [--save-file> I<zu_speichernde_Datei>B<]> B<[--port> I<TCP-Port>B<]>

source: If a fakeroot process wants to change the ownership of a file, then B<faked> is the process that remembers that new owner. If later the same fakeroot process does a stat() for that filename, then the libfakeroot wrapped stat() call will first ask faked for the fake ownership etc of that file, and then report it.
de: Falls ein fakeroot-Prozess die Besitzrechte einer Datei ändern möchte, dann ist B<faked> der Prozess, der sich an diesen neuen Besitzer erinnert. Falls der gleiche fakeroot-Prozess später stat() für diesen Dateinamen ausführt, dann wird der von libfakeroot eingehüllte stat()-Aufruf zuerst faked nach den Besitzrechten etc. der Datei fragen und diese dann zurückliefern.

source: Print debugging information on stderr.
de: gibt Informationen zur Fehlersuche auf der Standardfehlerausgabe aus.

source: Don't fork into the background.
de: verzweigt nicht in den Hintergrund.

source: B<--cleanup \ number>
de: B<--cleanup \ Nummer>

source: Cleanup the semaphores.
de: bereinigt Semaphore

source: B<--key \ key-number>
de: B<--key \ Schlüsselnummer>

source: Don't allocate a new communication channel, but use channel specified by key. (If the specified channel doesn't exist, it's created).
de: reserviert keinen neuen Kommunikationskanal, sondern benutzt den durch den Schlüssel angegebenen Kanal (falls der angegebene Kanal nicht existiert, wird er erzeugt).

source: B<--save-file \ save-file>
de: B<--save-file \ zu_speichernde_Datei>

source: Save the environment to save-file on exit.
de: sichert beim Beenden die Umgebung in zu_speichernde_Datei.

source: Load a previously saved environment from the standard input.
de: lädt eine vorher gesicherte Umgebung von der Standardeingabe.

source: Use real ownership of previously-unknown files instead of setting them to root:root.
de: benutzt echte Besitzrechte von vorher unbekannten Dateien, anstatt sie auf root:root zu setzen.

source: Use TCP port tcp-port.
de: benutzt TCP-Port tcp-port.

source: None so far. Be warned, though: although I've written quite a few much larger (and smaller) programs, I've never written anything that was as tiny as B<fakeroot>, had as many bugs as B<fakeroot>, and still was as usable as, say, B<fakeroot> version 0.0_3, the first version that could be used to build itself.
de: Bisher keine. Seien Sie dennoch gewarnt: Obwohl der Autor eine ganze Reihe wesentlich größere (und kleinere) Programme geschrieben hat, hat er nie etwas geschrieben, das so klein wie B<fakeroot> war und so viele Fehler wie B<fakeroot> hatte und immer noch so benutzbar war wie etwa B<fakeroot> Version 0.0_3, der ersten Version, die benutzt werden konnte, um sich selbst zu bauen.

source: mostly by J.H.M. Dassen E<lt>jdassen@debian.orgE<gt> mods/additions by joost and Clint.
de: größtenteils von J.H.M. Dassen E<lt>jdassen@debian.orgE<gt>. Mods/Zusätze von Joost und Clint.

source: B<fakeroot>(1), B<dpkg-buildpackage>(1), B<debuild>(1) B</usr/share/doc/fakeroot/DEBUG>
de: B<debuild>(1), B<dpkg-buildpackage>(1), B<fakeroot>(1), B</usr/share/doc/fakeroot/DEBUG>
